//=========================================================
// fbx_container_manager.h
// author:takeshi iwasawa
//=========================================================

//-------------------------------------
// include guard
//-------------------------------------
#pragma once
#ifndef __FbxContainerManager_H__
#define __FbxContainerManager_H__


//================================================================================
// クラス
//================================================================================
class FbxMyContainer;
class FbxContainerManager
{
	public:

		//================================================================================
		// FBXコンテナの取得
		// 戻り値 : FBXコンテナ
		// 引数1 : ファイルパス
		//================================================================================
		static FbxMyContainer* GetContainer(const std::string &file_path);

		//================================================================================
		// 全FBX解放
		// 戻り値 : なし
		// 引数1 : なし
		//================================================================================
		static void AllRelease(void);

	private:
		FbxContainerManager(void){}
		~FbxContainerManager(void){}

		//================================================================================
		// 変数宣言
		//================================================================================
		static std::list<FbxMyContainer*>		fbx_container_list_;		// FBXコンテナリスト
};

#endif // _FBX_MANAGER_H_